Revit 2020 API
ImageImportOptions Properties
The ImageImportOptions type exposes the following members.
Properties
Name | Description
Placement
Identifies which point of the image will be aligned to the placement point RefPoint.
RefPoint
Reference point (in Revit) to which the image is going to be inserted.
 (Inherited from GenericImportOptions.)
Resolution
Resolution to use (in dpi) for the image to be imported.
See Also
ImageImportOptions Class
Autodesk.Revit.DB Namespace